[Killed] BlockStatement
src/operacoes.js:21:32
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
+  for (let i = 2; i <= n; i++) {}
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1
